---
kind: method
id: M:Autodesk.Revit.DB.Face.Triangulate
source: html/8cd4a132-b874-442d-6739-43df3319eac9.htm
---
# Autodesk.Revit.DB.Face.Triangulate Method

Returns a triangular mesh approximation to the face.

## Syntax (C#)
```csharp
public Mesh Triangulate()
```

## Remarks
Tolerance of approximation is defined internally by Revit to be adequate for
display purposes.